[M_IrisEp3Battle_BarFight MissionDefinition]
MissionDescription="Piston has betrayed you. He drugged you, had you taken out of the arena, and convinced everyone that you ran away like a coward.<br><br>Unfortunately, since he was also your sponsor, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]Pyro Pete's[-place] and find a new sponsor there.<br><br>As it turns out, a gladiator named Pyro Pete has kidnapped the sponsor you've been looking for. He'll give the sponsor up, but only if you start some trouble in [place]Pyro Pete's[-place]. <br><br>You have literally no reason to believe he'll keep his word, but, you know. Eh."
TeaserText="Kill some dudes for Pyro Pete so he'll give you the sponsor he kidnapped."

[M_IrisEp3Battle_BarFight2 MissionDefinition]
MissionDescription="Kill as many badass Bar Patrons as you can in the time given.<br><br>Tier 2 Difficulty."

[M_IrisEp3Battle_BarFight3 MissionDefinition]
MissionDescription="Kill as many badass Bar Patrons as you can in the time given.<br><br>Tier 3 Difficulty."

[M_IrisEp3Battle_BarFightR3 MissionDefinition]
MissionDescription="Kill as many badass Bar Patrons as you can in the time given.<br><br>Tier 3 Difficulty."
